src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНоменклатуры</name>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяЦена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/УстановкаЦенНоменклатуры/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТД = Элементы.Товары.ТекущиеДанные;
	ТД.ТекущаяЦена = ПолучитьЦенуНаСервере(ТД.Номенклатура);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНаСервере(Номенклатура)
	
	Возврат ОбщегоНазначения.ПолучитьЦенуНоменклатурыНаДату(Номенклатура, Объект.Дата);
	
КонецФункции // ПолучитьЦенуНаСервере()


&НаКлиенте
Процедура Добавить(Команда)
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.НоваяЦена = СтрокаТЧ.ТекущаяЦена + ПараметрРасчета;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Умножить(Команда)
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.НоваяЦена = СтрокаТЧ.ТекущаяЦена * ПараметрРасчета;
	КонецЦикла;
КонецПроцедуры
